Revit 2024 API
Application.MinimumThickness Property
 The minimum thickness allowed in Revit for a variety of geometric constructs. These include blends, extrusions, and wall layers.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public static double MinimumThickness { get; }
Visual Basic
Public Shared ReadOnly Property MinimumThickness As Double
	Get
Visual C++
public:
static property double MinimumThickness {
	double get ();
}
Remarks
 Do not use this value for any purpose other than its intended purpose. If you want to check for valid thickness value, use the function isValidThickness.
See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace